Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/edc/PIC32CM1216LS00032.PIC
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSB" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x3F" edc:_addr="0x40000038">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:nzwidth="0x1" edc:desc="IDAU APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="STATUSC" edc:nzwidth="0x20" edc:access="----------rr-rrrrr----rrr---rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x37C38F" edc:_addr="0x4000003C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL APB Protect Enable"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP APB Protect Enable"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:nzwidth="0x1" edc:desc="TRAM APB Protect Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x40000040"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECA" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x40000054">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM Non-Secure"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK Non-Secure"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK Non-Secure"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT Non-Secure"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT Non-Secure"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECB" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000010" edc:mclr="00000000000000000000000000000010" edc:impl="0x3F" edc:_addr="0x40000058">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:nzwidth="0x1" edc:desc="IDAU Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU Non-Secure"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS Non-Secure"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="NONSECC" edc:nzwidth="0x20" edc:access="----------rr-rrrrr----rrr---rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x37C38F" edc:_addr="0x4000005C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 Non-Secure"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 Non-Secure"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG Non-Secure"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL Non-Secure"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP Non-Secure"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:nzwidth="0x1" edc:desc="TRAM Non-Secure"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x14" edc:_addr="0x40000060"/>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="SECLOCKA" edc:nzwidth="0x20" edc:access="------------------rrrrrrrrrrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x3FFF" edc:_addr="0x40000074">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:nzwidth="0x1" edc:desc="PAC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:nzwidth="0x1" edc:desc="PM Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:nzwidth="0x1" edc:desc="MCLK Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:nzwidth="0x1" edc:desc="RSTC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:nzwidth="0x1" edc:desc="OSCCTRL Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:nzwidth="0x1" edc:desc="OSC32KCTRL Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:nzwidth="0x1" edc:desc="SUPC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:nzwidth="0x1" edc:desc="GCLK Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:nzwidth="0x1" edc:desc="WDT Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:nzwidth="0x1" edc:desc="RTC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:nzwidth="0x1" edc:desc="EIC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:nzwidth="0x1" edc:desc="FREQM Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:nzwidth="0x1" edc:desc="PORT Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:nzwidth="0x1" edc:desc="AC Secure Status Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="SECLOCKB" edc:nzwidth="0x20" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000011" edc:mclr="00000000000000000000000000000011" edc:impl="0x3F" edc:_addr="0x40000078">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="IDAU_" edc:nzwidth="0x1" edc:desc="IDAU Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:nzwidth="0x1" edc:desc="DSU Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:nzwidth="0x1" edc:desc="NVMCTRL Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:nzwidth="0x1" edc:desc="DMAC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="HMATRIXHS_" edc:nzwidth="0x1" edc:desc="HMATRIXHS Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="USB_" edc:nzwidth="0x1" edc:desc="USB Secure Status Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PAC" edc:cname="SECLOCKC" edc:nzwidth="0x20" edc:access="----------rr-rrrrr----rrr---rrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x37C38F" edc:_addr="0x4000007C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:nzwidth="0x1" edc:desc="EVSYS Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:nzwidth="0x1" edc:desc="SERCOM0 Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:nzwidth="0x1" edc:desc="SERCOM1 Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:nzwidth="0x1" edc:desc="SERCOM2 Secure Status Locked"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:nzwidth="0x1" edc:desc="TC0 Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:nzwidth="0x1" edc:desc="TC1 Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:nzwidth="0x1" edc:desc="TC2 Secure Status Locked"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:nzwidth="0x1" edc:desc="ADC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="DAC_" edc:nzwidth="0x1" edc:desc="DAC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:nzwidth="0x1" edc:desc="PTC Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:nzwidth="0x1" edc:desc="TRNG Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:nzwidth="0x1" edc:desc="CCL Secure Status Locked"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="OPAMP_" edc:nzwidth="0x1" edc:desc="OPAMP Secure Status Locked"/>
            <edc:SFRFieldDef edc:cname="TRAM_" edc:nzwidth="0x1" edc:desc="TRAM Secure Status Locked"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
