Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.2.274/PIC32CM-LS00/edc/PIC32CM1216LS00032.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0INTENSET" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x40003264">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0INTFLAG" edc:nzwidth="0x20" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:impl="0x1" edc:_addr="0x40003268">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x1" edc:desc="Non-Secure Check"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0NONSEC" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000326C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NONSEC" edc:nzwidth="0x20" edc:desc="Port Security Attribution"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0NSCHK" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x40003270">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="NSCHK" edc:nzwidth="0x20" edc:desc="Port Security Attribution Check"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x18C" edc:_addr="0x40003274"/>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="CTRLA" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40003400">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="SWRST" edc:nzwidth="0x1" edc:desc="Software Reset"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="CTRLB" edc:nzwidth="0x8" edc:access="------nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40003401">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="START0" edc:nzwidth="0x1" edc:desc="Comparator 0 Start Comparison"/>
            <edc:SFRFieldDef edc:cname="START1" edc:nzwidth="0x1" edc:desc="Comparator 1 Start Comparison"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="EVCTRL" edc:nzwidth="0x10" edc:access="--nn--nn---n--nn" edc:por="0000000000000000" edc:mclr="0000000000000000" edc:impl="0x3313" edc:_addr="0x40003402">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMPEO0" edc:nzwidth="0x1" edc:desc="Comparator 0 Event Output Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEO1" edc:nzwidth="0x1" edc:desc="Comparator 1 Event Output Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WINEO0" edc:nzwidth="0x1" edc:desc="Window 0 Event Output Enable"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="COMPEI0" edc:nzwidth="0x1" edc:desc="Comparator 0 Event Input Enable"/>
            <edc:SFRFieldDef edc:cname="COMPEI1" edc:nzwidth="0x1" edc:desc="Comparator 1 Event Input Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="INVEI0" edc:nzwidth="0x1" edc:desc="Comparator 0 Input Event Invert Enable"/>
            <edc:SFRFieldDef edc:cname="INVEI1" edc:nzwidth="0x1" edc:desc="Comparator 1 Input Event Invert Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTENCLR" edc:nzwidth="0x8" edc:access="---n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x13" edc:_addr="0x40003404">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTENSET" edc:nzwidth="0x8" edc:access="---n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x13" edc:_addr="0x40003405">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0 Interrupt Enable"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1 Interrupt Enable"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0 Interrupt Enable"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="INTFLAG" edc:nzwidth="0x8" edc:access="---n--nn" edc:por="00000000" edc:mclr="00000000" edc:impl="0x13" edc:_addr="0x40003406">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="COMP0" edc:nzwidth="0x1" edc:desc="Comparator 0"/>
            <edc:SFRFieldDef edc:cname="COMP1" edc:nzwidth="0x1" edc:desc="Comparator 1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WIN0" edc:nzwidth="0x1" edc:desc="Window 0"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="STATUSA" edc:nzwidth="0x8" edc:access="--rr--rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x33" edc:_addr="0x40003407">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="STATE0" edc:nzwidth="0x1" edc:desc="Comparator 0 Current State"/>
            <edc:SFRFieldDef edc:cname="STATE1" edc:nzwidth="0x1" edc:desc="Comparator 1 Current State"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WSTATE0" edc:nzwidth="0x2" edc:desc="Window 0 Current State">
              <edc:SFRFieldSemantic edc:cname="ABOVE" edc:desc="Signal is above window" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="INSIDE" edc:desc="Signal is inside window" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="BELOW" edc:desc="Signal is below window" edc:when="(field &amp; 0x3) == 0x02"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="AC" edc:cname="STATUSB" edc:nzwidth="0x8" edc:access="------rr" edc:por="00000000" edc:mclr="00000000" edc:impl="0x3" edc:_addr="0x40003408">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="AC">
            <edc:SFRFieldDef edc:cname="READY0" edc:nzwidth="0x1" edc:desc="Comparator 0 Ready"/>
            <edc:SFRFieldDef edc:cname="READY1" edc:nzwidth="0x1" edc:desc="Comparator 1 Ready"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
